HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static void prvAddAllowedMACAddress( const uint8_t * pucMacAddress )
{
    /* ETH_MAC_ADDRESS0 reserved for the primary MAC-address. */
    static const uint32_t xMacAddressEntries[ niEMAC_MAC_SRC_MATCH_COUNT ] = { ETH_MAC_ADDRESS1, ETH_MAC_ADDRESS2, ETH_MAC_ADDRESS3 };

    BaseType_t xFound = pdFALSE;
    for( UBaseType_t uxIndex = 0; ( uxIndex < ARRAY_SIZE( xMatchedMacAddresses ) ) && ( uxIndex < uxMACEntryIndex ); ++uxIndex )
    {
        /* Temporary inefficient method to avoid writing a HAL_ETH_GetSourceMACAddrMatch for Hx & Fx */
        if( memcmp( pucMacAddress, xMatchedMacAddresses[ uxIndex ].ucBytes, ipMAC_ADDRESS_LENGTH_BYTES ) == 0 )
        {
            /* Already assigned this mac address */
            xFound = pdTRUE;
        }
    }

    if( xFound == pdFALSE )
    {
        ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
        ETH_MACFilterConfigTypeDef xFilterConfig;
        ( void ) HAL_ETH_GetMACFilterConfig( pxEthHandle, &xFilterConfig );

        if( uxMACEntryIndex < ARRAY_SIZE( xMacAddressEntries ) )
        {
            ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, xMacAddressEntries[ uxMACEntryIndex ], ( uint8_t * ) pucMacAddress );
            ( void ) memcpy( xMatchedMacAddresses[ uxMACEntryIndex ].ucBytes, pucMacAddress, ipMAC_ADDRESS_LENGTH_BYTES );
            /* if( xFilterConfig.SrcAddrFiltering == DISABLE )
            {
                xFilterConfig.SrcAddrFiltering = ENABLE;
                ( void ) HAL_ETH_SetMACFilterConfig( pxEthHandle, &xFilterConfig );
            } */
        }
        else
        {
            prvUpdateMacHashFilter( pxEthHandle, pucMacAddress );
            if( niEMAC_MAC_IS_MULTICAST( pucMacAddress ) == pdTRUE )
            {
                if( xFilterConfig.HashMulticast == DISABLE )
                {
                    xFilterConfig.HashMulticast = ENABLE;
                    ( void ) HAL_ETH_SetMACFilterConfig( pxEthHandle, &xFilterConfig );
                }
            }
            else
            {
                if( xFilterConfig.HashUnicast == DISABLE )
                {
                    xFilterConfig.HashUnicast = ENABLE;
                    ( void ) HAL_ETH_SetMACFilterConfig( pxEthHandle, &xFilterConfig );
                }
            }
        }
        ++uxMACEntryIndex;
    }
}

/*---------------------------------------------------------------------------*/

#if 0

static void prvRemoveAllowedMACAddress( const uint8_t * pucMacAddress )
{
    configASSERT( pucMacAddress );

    /* const BaseType_t xIsMulticast = niEMAC_MAC_IS_MULTICAST( pucMacAddress ); */

    BaseType_t xFound = pdFALSE;
    for( UBaseType_t uxIndex = 0; uxIndex < ARRAY_SIZE( xMatchedMacAddresses ); ++uxIndex )
    {
        /* Temporary inefficient method to avoid writing a HAL_ETH_GetSourceMACAddrMatch for Hx & Fx */
        if( memcmp( pucMacAddress, xMatchedMacAddresses[ uxIndex ].ucBytes, ipMAC_ADDRESS_LENGTH_BYTES ) == 0 )
        {
            /* Already assigned this mac address */
            xFound = pdTRUE;
        }
    }

    if( xFound == pdTRUE )
    {
        ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
        ETH_MACFilterConfigTypeDef xFilterConfig;
        ( void ) HAL_ETH_GetMACFilterConfig( pxEthHandle, &xFilterConfig );

    }
}

#endif

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              EMAC Task                                    */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInput( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;
    UBaseType_t uxCount = 0;
    /* if( ( xMacInitStatus == eMacInitComplete ) && ( heth->gState == HAL_ETH_STATE_STARTED ) ) */
    #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
        NetworkBufferDescriptor_t * pxStartDescriptor = NULL;
        NetworkBufferDescriptor_t * pxEndDescriptor = NULL;
    #endif
    NetworkBufferDescriptor_t * pxCurDescriptor = NULL;

    while( HAL_ETH_ReadData( pxEthHandle, ( void ** ) &pxCurDescriptor ) == HAL_OK )
    {
        ++uxCount;
        if( pxCurDescriptor == NULL )
        {
            /* Buffer was dropped, ignore packet */
            continue;
        }
        configASSERT( pxEthHandle->RxDescList.RxDataLength <= niEMAC_DATA_BUFFER_SIZE );

        pxCurDescriptor->pxInterface = pxInterface;
        pxCurDescriptor->pxEndPoint = FreeRTOS_MatchingEndpoint( pxCurDescriptor->pxInterface, pxCurDescriptor->pucEthernetBuffer );
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            if( pxStartDescriptor == NULL )
            {
                pxStartDescriptor = pxCurDescriptor;
            }
            else if( pxEndDescriptor != NULL )
            {
                pxEndDescriptor->pxNextBuffer = pxCurDescriptor;
            }
            pxEndDescriptor = pxCurDescriptor;
        #else
            prvSendRxEvent( pxCurDescriptor );
        #endif
    }

    if( uxCount > 0 )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            prvSendRxEvent( pxStartDescriptor );
        #endif
        xResult = pdTRUE;
    }
    else
    {
        /*if( pxEthHandle->gState != HAL_ETH_STATE_STARTED )
        {
            ( void ) xTaskNotify( xEMACTaskHandle, eMacEventErrEth, eSetBits );
        }*/
        xResult = pdFALSE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static portTASK_FUNCTION( prvEMACHandlerTask, pvParameters )
{
    NetworkInterface_t * pxInterface = ( NetworkInterface_t * ) pvParameters;
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
    EthernetPhy_t * pxPhyObject = &xPhyObject;

    /* iptraceEMAC_TASK_STARTING(); */

    for( ;; )
    {
        BaseType_t xResult = pdFALSE;
        uint32_t ulISREvents = 0U;

        if( xTaskNotifyWait( 0U, eMacEventAll, &ulISREvents, pdMS_TO_TICKS( niEMAC_TASK_MAX_BLOCK_TIME_MS ) ) == pdTRUE )
        {
            if( ( ulISREvents & eMacEventRx ) != 0 )
            {
                xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
            }

            if( ( ulISREvents & eMacEventTx ) != 0 )
            {
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
                {
                    ( void ) HAL_ETH_ReleaseTxPacket( pxEthHandle );
                    ( void ) xSemaphoreGive( xTxMutex );
                }
            }

            if( ( ulISREvents & eMacEventErrRx ) != 0 )
            {
                /*do
                {
                    xResult = ( prvNetworkInterfaceInput() > 0 );
                } while ( xResult != pdFALSE );
                xResult = pdTRUE;*/
            }

            if( ( ulISREvents & eMacEventErrTx ) != 0 )
            {
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
                {
                    ( void ) HAL_ETH_ReleaseTxPacket( pxEthHandle );
                }
            }

