HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
        for( uint8_t ucJndex = 0; ucJndex < 8; ++ucJndex )
        {
            const BaseType_t xTemp = ulCRC32 & 1;
            ulCRC32 >>= 1;
            if( xTemp )
            {
                ulCRC32 ^= __RBIT( niEMAC_CRC_POLY );
            }
        }
    }

    /* Perform bitwise reversal on the CRC32 */
    return __RBIT( ~ulCRC32 );
}

/*---------------------------------------------------------------------------*/

/* Update the Hash Table Registers with hash value of the given MAC address */
static void prvUpdateMacHashFilter( ETH_HandleTypeDef * pxEthHandle, const uint8_t * pucMAC )
{
    static uint32_t ulHashTable[ 2 ];

    /* Calculate the 32-bit CRC for the MAC */
    const uint32_t ulHash = prvCalcCrc32( pucMAC );

    /* Take the upper 6 bits of the above result */
    const uint8_t ucEntry = ( ulHash >> 26 ) & 0x3F;

    /* Use the upper or lower Hash Table Registers
     * to set the required bit based on the ulHash */
    if( ucEntry < 32 )
    {
        ulHashTable[ 0 ] |= ( 1 << ucEntry );
    }
    else
    {
        ulHashTable[ 1 ] |= ( 1 << ( ucEntry % 32 ) );
    }

    ( void ) HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
}

/*---------------------------------------------------------------------------*/

static void prvReleaseNetworkBufferDescriptor( NetworkBufferDescriptor_t * const pxDescriptor )
{
    NetworkBufferDescriptor_t * pxDescriptorToClear = pxDescriptor;
    while( pxDescriptorToClear != NULL )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            NetworkBufferDescriptor_t * const pxNext = pxDescriptorToClear->pxNextBuffer;
        #else
            NetworkBufferDescriptor_t * const pxNext = NULL;
        #endif
        vReleaseNetworkBufferAndDescriptor( pxDescriptorToClear );
        pxDescriptorToClear = pxNext;
    };
}

/*---------------------------------------------------------------------------*/

static void prvSendRxEvent( NetworkBufferDescriptor_t * const pxDescriptor )
{
    const IPStackEvent_t xRxEvent = {
        .eEventType = eNetworkRxEvent,
        .pvData = ( void * ) pxDescriptor
    };
    if( xSendEventStructToIPTask( &xRxEvent, pdMS_TO_TICKS( niEMAC_RX_MAX_BLOCK_TIME_MS ) ) != pdPASS )
    {
        iptraceETHERNET_RX_EVENT_LOST();
        FreeRTOS_debug_printf( ( "prvSendRxEvent: xSendEventStructToIPTask failed\n" ) );
        prvReleaseNetworkBufferDescriptor( pxDescriptor );
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                           Filter Helpers                                  */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#ifdef niEMAC_STM32HX

static void prvInitPacketFilter( ETH_HandleTypeDef * pxEthHandle, const NetworkInterface_t * const pxInterface )
{
    HAL_ETHEx_DisableL3L4Filtering( pxEthHandle );

    ETH_MACConfigTypeDef xMACConfig;
    ( void ) HAL_ETH_GetMACConfig( pxEthHandle , &xMACConfig );
    if( xMACConfig.ChecksumOffload == ENABLE )
    {
        const uint32_t uxL3FilterIds[ 2 ] = { ETH_L3_FILTER_0, ETH_L3_FILTER_1 };
        uint32_t uxL3FilterIdIndex = 0;

        for( NetworkEndPoint_t * pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface ); pxEndPoint != NULL; pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
        {
            ETH_L3FilterConfigTypeDef xL3FilterConfig;
            /* #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) ) */
            if( ENDPOINT_IS_IPv4( pxEndPoint ) )
            {
                ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, uxL3FilterIds[ uxL3FilterIdIndex ], &xL3FilterConfig );
                xL3FilterConfig.Protocol = ETH_L3_IPV4_MATCH;
                ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, uxL3FilterIds[ uxL3FilterIdIndex++ ], &xL3FilterConfig );
            }
            /* #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) ) */
            else if( ENDPOINT_IS_IPv6( pxEndPoint ) )
            {
                ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, uxL3FilterIds[ uxL3FilterIdIndex ], &xL3FilterConfig );
                xL3FilterConfig.Protocol = ETH_L3_IPV6_MATCH;
                ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, uxL3FilterIds[ uxL3FilterIdIndex++ ], &xL3FilterConfig );
            }

            if( uxL3FilterIdIndex >= ARRAY_SIZE( uxL3FilterIds ) )
            {
                break;
            }
        }

        /* TODO: This needs to be live updated based on sockets? */
        /* ETH_L4FilterConfigTypeDef xL4FilterConfigUDP;
        ( void ) HAL_ETHEx_GetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_0, &xL4FilterConfigUDP );
        xL4FilterConfigUDP.Protocol = ETH_L4_UDP_MATCH;
        ( void ) HAL_ETHEx_SetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_0, &xL4FilterConfigUDP );

        #if ( ipconfigIS_ENABLED( ipconfigUSE_TCP ) )
            ETH_L4FilterConfigTypeDef xL4FilterConfigTCP;
            ( void ) HAL_ETHEx_GetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_1, &xL4FilterConfigTCP );
            xL4FilterConfigTCP.Protocol = ETH_L4_TCP_MATCH;
            ( void ) HAL_ETHEx_SetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_1, &xL4FilterConfigTCP );
        #endif */

        HAL_ETHEx_EnableL3L4Filtering( pxEthHandle );
    }
}

#endif /* ifdef niEMAC_STM32HX */

/*---------------------------------------------------------------------------*/

static BaseType_t prvAcceptPacket( const NetworkBufferDescriptor_t * const pxDescriptor, uint16_t usLength )
{
    BaseType_t xResult = pdFALSE;
    do
    {
        if( pxDescriptor == NULL )
        {
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Null Descriptor\n" ) );
            break;
        }

        uint32_t ulErrorCode = 0;
        ( void ) HAL_ETH_GetRxDataErrorCode( &xEthHandle, &ulErrorCode );
        if( ulErrorCode != 0 )
        {
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Rx Data Error\n" ) );
            break;
        }

        if( usLength > niEMAC_DATA_BUFFER_SIZE )
        {
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet size overflow\n" ) );
            break;
        }

